# Создайте простое веб-приложение на Flask. Следуйте следующему алгоритму:
#
#     Настройка проекта:
#
#         Создайте новый проект в PyCharm.
#
#         Настройте виртуальное окружение для проекта, используя либо встроенные средства IDE, либо командную строку (см. инструкции в лекции).
#
#         Активируйте виртуальное окружение и установите Flask с помощью pip.
#
#     Создание базового Flask-приложения:
#
#         Создайте файл main.py.
#         Импортируйте необходимые модули (Flask).
#
#         Напишите код для создания экземпляра Flask-приложения.
#
#         Добавьте маршрут, который будет отвечать на корневой URL (/) и возвращать простое приветствие, например, "Hello, Flask!".
#
#     Расширение функциональности:
#
#         Добавьте дополнительный маршрут /user/<name>, который будет возвращать приветственное сообщение с переданным именем..
#
#     Запуск и тестирование приложения:
#
#         Запустите приложение убедитесь, что все маршруты работают корректно.
#
#         Приложите как решение ваш проект на гите и скриншоты с проверкой работы всех маршрутов.